; domain
(define (domain driverlog)
  (:requirements :typing :fluents)
  (:types
    location locatable - object
    driver truck obj - locatable
  )

  (:predicates
    (at ?obj - locatable ?loc - location)
    (in ?obj1 - obj ?obj - truck)
    (driving ?d - driver ?v - truck)
    (link ?x - location ?y - location)
    (path ?x - location ?y - location)
    (empty ?v - truck)
  )
  (:functions
    (time-to-walk ?l1 - location ?l2 - location)
    (time-to-drive ?l1 - location ?l2 - location)
    (driven)
    (walked)
  )

  (:action LOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and
      (at ?truck ?loc)
      (at ?obj ?loc))
    :effect (and (not (at ?obj ?loc)) (in ?obj ?truck))
  )

  (:action UNLOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (in ?obj ?truck))
    :effect (and (not (in ?obj ?truck)) (at ?obj ?loc))
  )

  (:action BOARD-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
    :effect (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck)))
  )

  (:action DISEMBARK-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (driving ?driver ?truck))
    :effect (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck))
  )

  (:action DRIVE-TRUCK
    :parameters (?truck - truck ?loc-from - location ?loc-to - location ?driver - driver)
    :precondition (and (at ?truck ?loc-from)
      (driving ?driver ?truck) (link ?loc-from ?loc-to))
    :effect (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
      (increase
        (driven)
        (time-to-drive ?loc-from ?loc-to)))
  )

  (:action WALK
    :parameters (?driver - driver ?loc-from - location ?loc-to - location)
    :precondition (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
    :effect (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)
      (increase
        (walked)
        (time-to-walk ?loc-from ?loc-to)))
  )

)

; problem
(define (problem DLOG-5-7-12)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	truck6 - truck
	truck7 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	package8 - obj
	package9 - obj
	package10 - obj
	package11 - obj
	package12 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	p0-1 - location
	p0-3 - location
	p0-6 - location
	p1-2 - location
	p1-4 - location
	p2-4 - location
	p2-6 - location
	p3-2 - location
	p3-4 - location
	p3-5 - location
	p4-0 - location
	p6-1 - location
	)
	(:init
	(at driver1 s4)
	(at driver2 s4)
	(at driver3 s3)
	(at driver4 s3)
	(at driver5 s0)
	(at truck1 s0)
	(empty truck1)
	(at truck2 s2)
	(empty truck2)
	(at truck3 s4)
	(empty truck3)
	(at truck4 s3)
	(empty truck4)
	(at truck5 s5)
	(empty truck5)
	(at truck6 s0)
	(empty truck6)
	(at truck7 s2)
	(empty truck7)
	(at package1 s0)
	(at package2 s0)
	(at package3 s1)
	(at package4 s5)
	(at package5 s3)
	(at package6 s5)
	(at package7 s6)
	(at package8 s3)
	(at package9 s1)
	(at package10 s6)
	(at package11 s2)
	(at package12 s6)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(= (time-to-walk s0 p0-1) 83)
	(= (time-to-walk p0-1 s0) 83)
	(= (time-to-walk s1 p0-1) 60)
	(= (time-to-walk p0-1 s1) 60)
	(path s0 p0-3)
	(path p0-3 s0)
	(path s3 p0-3)
	(path p0-3 s3)
	(= (time-to-walk s0 p0-3) 82)
	(= (time-to-walk p0-3 s0) 82)
	(= (time-to-walk s3 p0-3) 81)
	(= (time-to-walk p0-3 s3) 81)
	(path s0 p0-6)
	(path p0-6 s0)
	(path s6 p0-6)
	(path p0-6 s6)
	(= (time-to-walk s0 p0-6) 44)
	(= (time-to-walk p0-6 s0) 44)
	(= (time-to-walk s6 p0-6) 56)
	(= (time-to-walk p0-6 s6) 56)
	(path s1 p1-2)
	(path p1-2 s1)
	(path s2 p1-2)
	(path p1-2 s2)
	(= (time-to-walk s1 p1-2) 62)
	(= (time-to-walk p1-2 s1) 62)
	(= (time-to-walk s2 p1-2) 100)
	(= (time-to-walk p1-2 s2) 100)
	(path s1 p1-4)
	(path p1-4 s1)
	(path s4 p1-4)
	(path p1-4 s4)
	(= (time-to-walk s1 p1-4) 61)
	(= (time-to-walk p1-4 s1) 61)
	(= (time-to-walk s4 p1-4) 82)
	(= (time-to-walk p1-4 s4) 82)
	(path s2 p2-4)
	(path p2-4 s2)
	(path s4 p2-4)
	(path p2-4 s4)
	(= (time-to-walk s2 p2-4) 76)
	(= (time-to-walk p2-4 s2) 76)
	(= (time-to-walk s4 p2-4) 30)
	(= (time-to-walk p2-4 s4) 30)
	(path s2 p2-6)
	(path p2-6 s2)
	(path s6 p2-6)
	(path p2-6 s6)
	(= (time-to-walk s2 p2-6) 85)
	(= (time-to-walk p2-6 s2) 85)
	(= (time-to-walk s6 p2-6) 71)
	(= (time-to-walk p2-6 s6) 71)
	(path s3 p3-2)
	(path p3-2 s3)
	(path s2 p3-2)
	(path p3-2 s2)
	(= (time-to-walk s3 p3-2) 45)
	(= (time-to-walk p3-2 s3) 45)
	(= (time-to-walk s2 p3-2) 80)
	(= (time-to-walk p3-2 s2) 80)
	(path s3 p3-4)
	(path p3-4 s3)
	(path s4 p3-4)
	(path p3-4 s4)
	(= (time-to-walk s3 p3-4) 27)
	(= (time-to-walk p3-4 s3) 27)
	(= (time-to-walk s4 p3-4) 42)
	(= (time-to-walk p3-4 s4) 42)
	(path s3 p3-5)
	(path p3-5 s3)
	(path s5 p3-5)
	(path p3-5 s5)
	(= (time-to-walk s3 p3-5) 4)
	(= (time-to-walk p3-5 s3) 4)
	(= (time-to-walk s5 p3-5) 52)
	(= (time-to-walk p3-5 s5) 52)
	(path s4 p4-0)
	(path p4-0 s4)
	(path s0 p4-0)
	(path p4-0 s0)
	(= (time-to-walk s4 p4-0) 40)
	(= (time-to-walk p4-0 s4) 40)
	(= (time-to-walk s0 p4-0) 20)
	(= (time-to-walk p4-0 s0) 20)
	(path s6 p6-1)
	(path p6-1 s6)
	(path s1 p6-1)
	(path p6-1 s1)
	(= (time-to-walk s6 p6-1) 48)
	(= (time-to-walk p6-1 s6) 48)
	(= (time-to-walk s1 p6-1) 72)
	(= (time-to-walk p6-1 s1) 72)
	(link s0 s2)
	(link s2 s0)
	(= (time-to-drive s0 s2) 88)
	(= (time-to-drive s2 s0) 88)
	(link s0 s4)
	(link s4 s0)
	(= (time-to-drive s0 s4) 81)
	(= (time-to-drive s4 s0) 81)
	(link s0 s6)
	(link s6 s0)
	(= (time-to-drive s0 s6) 10)
	(= (time-to-drive s6 s0) 10)
	(link s1 s0)
	(link s0 s1)
	(= (time-to-drive s1 s0) 55)
	(= (time-to-drive s0 s1) 55)
	(link s2 s3)
	(link s3 s2)
	(= (time-to-drive s2 s3) 80)
	(= (time-to-drive s3 s2) 80)
	(link s2 s4)
	(link s4 s2)
	(= (time-to-drive s2 s4) 53)
	(= (time-to-drive s4 s2) 53)
	(link s2 s5)
	(link s5 s2)
	(= (time-to-drive s2 s5) 72)
	(= (time-to-drive s5 s2) 72)
	(link s4 s6)
	(link s6 s4)
	(= (time-to-drive s4 s6) 63)
	(= (time-to-drive s6 s4) 63)
	(link s5 s1)
	(link s1 s5)
	(= (time-to-drive s5 s1) 13)
	(= (time-to-drive s1 s5) 13)
	(link s5 s3)
	(link s3 s5)
	(= (time-to-drive s5 s3) 53)
	(= (time-to-drive s3 s5) 53)
	(link s5 s4)
	(link s4 s5)
	(= (time-to-drive s5 s4) 43)
	(= (time-to-drive s4 s5) 43)
	(link s6 s3)
	(link s3 s6)
	(= (time-to-drive s6 s3) 57)
	(= (time-to-drive s3 s6) 57)
	(link s6 s5)
	(link s5 s6)
	(= (time-to-drive s6 s5) 9)
	(= (time-to-drive s5 s6) 9)
	(= (driven) 0)
	(= (walked) 0)
)
	(:goal (and
	(at driver1 s0)
	(at driver2 s4)
	(at driver5 s0)
	(at truck1 s5)
	(at truck4 s6)
	(at truck5 s1)
	(at truck6 s6)
	(at truck7 s3)
	(at package1 s6)
	(at package2 s3)
	(at package3 s4)
	(at package4 s5)
	(at package5 s0)
	(at package7 s1)
	(at package8 s6)
	(at package9 s6)
	(at package10 s2)
	(at package11 s2)
	(at package12 s3)
	))

(:metric minimize (+ (+ (* 1  (total-time)) (* 3  (driven))) (* 3  (walked))))

)

; plan
1. (board-truck driver4 truck4 s3)
   deleted: (at driver4 s3) (empty truck4)
   added: (driving driver4 truck4)
   goals met: 4 of 19
2. (walk driver1 s4 p4-0)
   deleted: (at driver1 s4)
   added: (at driver1 p4-0)
   changed: (walked) from 0 to 40
   goals met: 4 of 19
3. (load-truck package5 truck4 s3)
   deleted: (at package5 s3)
   added: (in package5 truck4)
   goals met: 4 of 19
4. (load-truck package8 truck4 s3)
   deleted: (at package8 s3)
   added: (in package8 truck4)
   goals met: 4 of 19
5. (drive-truck truck4 s3 s2 driver4)
   deleted: (at truck4 s3)
   added: (at truck4 s2)
   changed: (driven) from 0 to 80
   goals met: 4 of 19
6. (drive-truck truck4 s2 s0 driver4)
   deleted: (at truck4 s2)
   added: (at truck4 s0)
   changed: (driven) from 80 to 168
   goals met: 4 of 19
7. (unload-truck package5 truck4 s0)
   deleted: (in package5 truck4)
   added: (at package5 s0)
   goals met: 5 of 19
8. (load-truck package1 truck4 s0)
   deleted: (at package1 s0)
   added: (in package1 truck4)
   goals met: 5 of 19
9. (walk driver3 s3 p3-5)
   deleted: (at driver3 s3)
   added: (at driver3 p3-5)
   changed: (walked) from 40 to 44
   goals met: 5 of 19
10. (walk driver3 p3-5 s5)
   deleted: (at driver3 p3-5)
   added: (at driver3 s5)
   changed: (walked) from 44 to 96
   goals met: 5 of 19
11. (load-truck package2 truck4 s0)
   deleted: (at package2 s0)
   added: (in package2 truck4)
   goals met: 5 of 19
12. (board-truck driver3 truck5 s5)
   deleted: (at driver3 s5) (empty truck5)
   added: (driving driver3 truck5)
   goals met: 5 of 19
13. (drive-truck truck5 s5 s1 driver3)
   deleted: (at truck5 s5)
   added: (at truck5 s1)
   changed: (driven) from 168 to 181
   goals met: 6 of 19
14. (board-truck driver5 truck1 s0)
   deleted: (at driver5 s0) (empty truck1)
   added: (driving driver5 truck1)
   goals met: 5 of 19
15. (walk driver1 p4-0 s0)
   deleted: (at driver1 p4-0)
   added: (at driver1 s0)
   changed: (walked) from 96 to 116
   goals met: 6 of 19
16. (drive-truck truck4 s0 s6 driver4)
   deleted: (at truck4 s0)
   added: (at truck4 s6)
   changed: (driven) from 181 to 191
   goals met: 7 of 19
17. (board-truck driver1 truck6 s0)
   deleted: (at driver1 s0) (empty truck6)
   added: (driving driver1 truck6)
   goals met: 6 of 19
18. (load-truck package12 truck4 s6)
   deleted: (at package12 s6)
   added: (in package12 truck4)
   goals met: 6 of 19
19. (unload-truck package1 truck4 s6)
   deleted: (in package1 truck4)
   added: (at package1 s6)
   goals met: 7 of 19
20. (drive-truck truck1 s0 s2 driver5)
   deleted: (at truck1 s0)
   added: (at truck1 s2)
   changed: (driven) from 191 to 279
   goals met: 7 of 19
21. (disembark-truck driver5 truck1 s2)
   deleted: (driving driver5 truck1)
   added: (at driver5 s2) (empty truck1)
   goals met: 7 of 19
22. (unload-truck package8 truck4 s6)
   deleted: (in package8 truck4)
   added: (at package8 s6)
   goals met: 8 of 19
23. (board-truck driver5 truck7 s2)
   deleted: (at driver5 s2) (empty truck7)
   added: (driving driver5 truck7)
   goals met: 8 of 19
24. (drive-truck truck4 s6 s3 driver4)
   deleted: (at truck4 s6)
   added: (at truck4 s3)
   changed: (driven) from 279 to 336
   goals met: 7 of 19
25. (unload-truck package2 truck4 s3)
   deleted: (in package2 truck4)
   added: (at package2 s3)
   goals met: 8 of 19
26. (disembark-truck driver5 truck7 s2)
   deleted: (driving driver5 truck7)
   added: (at driver5 s2) (empty truck7)
   goals met: 8 of 19
27. (unload-truck package12 truck4 s3)
   deleted: (in package12 truck4)
   added: (at package12 s3)
   goals met: 9 of 19
28. (drive-truck truck4 s3 s6 driver4)
   deleted: (at truck4 s3)
   added: (at truck4 s6)
   changed: (driven) from 336 to 393
   goals met: 10 of 19
29. (board-truck driver5 truck7 s2)
   deleted: (at driver5 s2) (empty truck7)
   added: (driving driver5 truck7)
   goals met: 10 of 19
30. (drive-truck truck7 s2 s3 driver5)
   deleted: (at truck7 s2)
   added: (at truck7 s3)
   changed: (driven) from 393 to 473
   goals met: 11 of 19
31. (disembark-truck driver5 truck7 s3)
   deleted: (driving driver5 truck7)
   added: (at driver5 s3) (empty truck7)
   goals met: 11 of 19
32. (walk driver5 s3 p0-3)
   deleted: (at driver5 s3)
   added: (at driver5 p0-3)
   changed: (walked) from 116 to 197
   goals met: 11 of 19
33. (walk driver5 p0-3 s0)
   deleted: (at driver5 p0-3)
   added: (at driver5 s0)
   changed: (walked) from 197 to 279
   goals met: 12 of 19
34. (walk driver2 s4 p2-4)
   deleted: (at driver2 s4)
   added: (at driver2 p2-4)
   changed: (walked) from 279 to 309
   goals met: 11 of 19
35. (walk driver2 p2-4 s2)
   deleted: (at driver2 p2-4)
   added: (at driver2 s2)
   changed: (walked) from 309 to 385
   goals met: 11 of 19
36. (load-truck package10 truck4 s6)
   deleted: (at package10 s6)
   added: (in package10 truck4)
   goals met: 11 of 19
37. (board-truck driver2 truck1 s2)
   deleted: (at driver2 s2) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 11 of 19
38. (drive-truck truck1 s2 s5 driver2)
   deleted: (at truck1 s2)
   added: (at truck1 s5)
   changed: (driven) from 473 to 545
   goals met: 12 of 19
39. (drive-truck truck4 s6 s3 driver4)
   deleted: (at truck4 s6)
   added: (at truck4 s3)
   changed: (driven) from 545 to 602
   goals met: 11 of 19
40. (drive-truck truck4 s3 s2 driver4)
   deleted: (at truck4 s3)
   added: (at truck4 s2)
   changed: (driven) from 602 to 682
   goals met: 11 of 19
41. (unload-truck package10 truck4 s2)
   deleted: (in package10 truck4)
   added: (at package10 s2)
   goals met: 12 of 19
42. (drive-truck truck4 s2 s4 driver4)
   deleted: (at truck4 s2)
   added: (at truck4 s4)
   changed: (driven) from 682 to 735
   goals met: 12 of 19
43. (drive-truck truck4 s4 s6 driver4)
   deleted: (at truck4 s4)
   added: (at truck4 s6)
   changed: (driven) from 735 to 798
   goals met: 13 of 19
44. (drive-truck truck1 s5 s6 driver2)
   deleted: (at truck1 s5)
   added: (at truck1 s6)
   changed: (driven) from 798 to 807
   goals met: 12 of 19
45. (load-truck package7 truck1 s6)
   deleted: (at package7 s6)
   added: (in package7 truck1)
   goals met: 12 of 19
46. (drive-truck truck1 s6 s0 driver2)
   deleted: (at truck1 s6)
   added: (at truck1 s0)
   changed: (driven) from 807 to 817
   goals met: 12 of 19
47. (drive-truck truck6 s0 s6 driver1)
   deleted: (at truck6 s0)
   added: (at truck6 s6)
   changed: (driven) from 817 to 827
   goals met: 13 of 19
48. (drive-truck truck1 s0 s1 driver2)
   deleted: (at truck1 s0)
   added: (at truck1 s1)
   changed: (driven) from 827 to 882
   goals met: 13 of 19
49. (load-truck package3 truck1 s1)
   deleted: (at package3 s1)
   added: (in package3 truck1)
   goals met: 13 of 19
50. (unload-truck package7 truck1 s1)
   deleted: (in package7 truck1)
   added: (at package7 s1)
   goals met: 14 of 19
51. (drive-truck truck1 s1 s5 driver2)
   deleted: (at truck1 s1)
   added: (at truck1 s5)
   changed: (driven) from 882 to 895
   goals met: 15 of 19
52. (drive-truck truck1 s5 s4 driver2)
   deleted: (at truck1 s5)
   added: (at truck1 s4)
   changed: (driven) from 895 to 938
   goals met: 14 of 19
53. (unload-truck package3 truck1 s4)
   deleted: (in package3 truck1)
   added: (at package3 s4)
   goals met: 15 of 19
54. (drive-truck truck6 s6 s0 driver1)
   deleted: (at truck6 s6)
   added: (at truck6 s0)
   changed: (driven) from 938 to 948
   goals met: 14 of 19
55. (drive-truck truck6 s0 s1 driver1)
   deleted: (at truck6 s0)
   added: (at truck6 s1)
   changed: (driven) from 948 to 1003
   goals met: 14 of 19
56. (load-truck package9 truck6 s1)
   deleted: (at package9 s1)
   added: (in package9 truck6)
   goals met: 14 of 19
57. (drive-truck truck6 s1 s0 driver1)
   deleted: (at truck6 s1)
   added: (at truck6 s0)
   changed: (driven) from 1003 to 1058
   goals met: 14 of 19
58. (drive-truck truck1 s4 s5 driver2)
   deleted: (at truck1 s4)
   added: (at truck1 s5)
   changed: (driven) from 1058 to 1101
   goals met: 15 of 19
59. (disembark-truck driver1 truck6 s0)
   deleted: (driving driver1 truck6)
   added: (at driver1 s0) (empty truck6)
   goals met: 16 of 19
60. (unload-truck package9 truck6 s0)
   deleted: (in package9 truck6)
   added: (at package9 s0)
   goals met: 16 of 19
61. (drive-truck truck1 s5 s4 driver2)
   deleted: (at truck1 s5)
   added: (at truck1 s4)
   changed: (driven) from 1101 to 1144
   goals met: 15 of 19
62. (drive-truck truck1 s4 s0 driver2)
   deleted: (at truck1 s4)
   added: (at truck1 s0)
   changed: (driven) from 1144 to 1225
   goals met: 15 of 19
63. (load-truck package9 truck1 s0)
   deleted: (at package9 s0)
   added: (in package9 truck1)
   goals met: 15 of 19
64. (drive-truck truck1 s0 s4 driver2)
   deleted: (at truck1 s0)
   added: (at truck1 s4)
   changed: (driven) from 1225 to 1306
   goals met: 15 of 19
65. (board-truck driver1 truck6 s0)
   deleted: (at driver1 s0) (empty truck6)
   added: (driving driver1 truck6)
   goals met: 14 of 19
66. (disembark-truck driver2 truck1 s4)
   deleted: (driving driver2 truck1)
   added: (at driver2 s4) (empty truck1)
   goals met: 15 of 19
67. (unload-truck package9 truck1 s4)
   deleted: (in package9 truck1)
   added: (at package9 s4)
   goals met: 15 of 19
68. (disembark-truck driver1 truck6 s0)
   deleted: (driving driver1 truck6)
   added: (at driver1 s0) (empty truck6)
   goals met: 16 of 19
69. (load-truck package9 truck3 s4)
   deleted: (at package9 s4)
   added: (in package9 truck3)
   goals met: 16 of 19
70. (board-truck driver2 truck3 s4)
   deleted: (at driver2 s4) (empty truck3)
   added: (driving driver2 truck3)
   goals met: 15 of 19
71. (drive-truck truck3 s4 s6 driver2)
   deleted: (at truck3 s4)
   added: (at truck3 s6)
   changed: (driven) from 1306 to 1369
   goals met: 15 of 19
72. (unload-truck package9 truck3 s6)
   deleted: (in package9 truck3)
   added: (at package9 s6)
   goals met: 16 of 19
73. (walk driver1 s0 p4-0)
   deleted: (at driver1 s0)
   added: (at driver1 p4-0)
   changed: (walked) from 385 to 405
   goals met: 15 of 19
74. (walk driver1 p4-0 s4)
   deleted: (at driver1 p4-0)
   added: (at driver1 s4)
   changed: (walked) from 405 to 445
   goals met: 15 of 19
75. (drive-truck truck3 s6 s4 driver2)
   deleted: (at truck3 s6)
   added: (at truck3 s4)
   changed: (driven) from 1369 to 1432
   goals met: 15 of 19
76. (board-truck driver1 truck1 s4)
   deleted: (at driver1 s4) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 15 of 19
77. (disembark-truck driver2 truck3 s4)
   deleted: (driving driver2 truck3)
   added: (at driver2 s4) (empty truck3)
   goals met: 16 of 19
78. (drive-truck truck1 s4 s0 driver1)
   deleted: (at truck1 s4)
   added: (at truck1 s0)
   changed: (driven) from 1432 to 1513
   goals met: 16 of 19
79. (disembark-truck driver1 truck1 s0)
   deleted: (driving driver1 truck1)
   added: (at driver1 s0) (empty truck1)
   goals met: 17 of 19
80. (board-truck driver1 truck6 s0)
   deleted: (at driver1 s0) (empty truck6)
   added: (driving driver1 truck6)
   goals met: 16 of 19
81. (board-truck driver5 truck1 s0)
   deleted: (at driver5 s0) (empty truck1)
   added: (driving driver5 truck1)
   goals met: 15 of 19
82. (drive-truck truck1 s0 s6 driver5)
   deleted: (at truck1 s0)
   added: (at truck1 s6)
   changed: (driven) from 1513 to 1523
   goals met: 15 of 19
83. (drive-truck truck1 s6 s5 driver5)
   deleted: (at truck1 s6)
   added: (at truck1 s5)
   changed: (driven) from 1523 to 1532
   goals met: 16 of 19
84. (disembark-truck driver5 truck1 s5)
   deleted: (driving driver5 truck1)
   added: (at driver5 s5) (empty truck1)
   goals met: 16 of 19
85. (disembark-truck driver3 truck5 s1)
   deleted: (driving driver3 truck5)
   added: (at driver3 s1) (empty truck5)
   goals met: 16 of 19
86. (disembark-truck driver4 truck4 s6)
   deleted: (driving driver4 truck4)
   added: (at driver4 s6) (empty truck4)
   goals met: 16 of 19
87. (drive-truck truck6 s0 s6 driver1)
   deleted: (at truck6 s0)
   added: (at truck6 s6)
   changed: (driven) from 1532 to 1542
   goals met: 17 of 19
88. (disembark-truck driver1 truck6 s6)
   deleted: (driving driver1 truck6)
   added: (at driver1 s6) (empty truck6)
   goals met: 17 of 19
89. (walk driver5 s5 p3-5)
   deleted: (at driver5 s5)
   added: (at driver5 p3-5)
   changed: (walked) from 445 to 497
   goals met: 17 of 19
90. (walk driver1 s6 p0-6)
   deleted: (at driver1 s6)
   added: (at driver1 p0-6)
   changed: (walked) from 497 to 553
   goals met: 17 of 19
91. (walk driver1 p0-6 s0)
   deleted: (at driver1 p0-6)
   added: (at driver1 s0)
   changed: (walked) from 553 to 597
   goals met: 18 of 19
92. (walk driver5 p3-5 s3)
   deleted: (at driver5 p3-5)
   added: (at driver5 s3)
   changed: (walked) from 597 to 601
   goals met: 18 of 19
93. (walk driver5 s3 p0-3)
   deleted: (at driver5 s3)
   added: (at driver5 p0-3)
   changed: (walked) from 601 to 682
   goals met: 18 of 19
94. (walk driver5 p0-3 s0)
   deleted: (at driver5 p0-3)
   added: (at driver5 s0)
   changed: (walked) from 682 to 764
   goals met: 19 of 19
